tutorials/melting/conduction/3D_cylinder_adiabatic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    side
    {
        type            noSlip;
        //type            fixedValue;
        //value           uniform (0.0018 0 0);
    }

    top
    {
        type            noSlip;
    }

    bottom
    {
        type            noSlip;
    }

/*
    south
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
*/
}

// ************************************************************************* //
