tutorials/melting/conduction/3D_cylinder_adiabatic/0/h
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 100999;

boundaryField
{    
    north
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform 293;
    }

    ovest
    {
        type            fixedValue;
        value           uniform 161600;
        //type            zeroGradient;
    }

    east
    {
        type            fixedValue;
        value           uniform 100999;
        //type            zeroGradient;
    }

    south
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform 260;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
