tutorials/melting/conduction/3D_cylinder_adiabatic/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-08;

boundaryField
{
    north
    {
        type            kqRWallFunction;
        value           uniform 3.75e-08;
    }
    east
    {
        type            kqRWallFunction;
        value           uniform 3.75e-08;
    }
    ovest
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }
    south
    {
        type            kqRWallFunction;
        value           uniform 3.75e-08;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
