tutorials/melting/conduction/3D_cylinder_adiabatic/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default	Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         leastSquares;
}

divSchemes
{
    default         Gauss QUICK;

   // div(phi,U)      bounded Gauss limitedLinear 0.2;
   // div(phi,K)      bounded Gauss limitedLinear 0.2;
   // div(phi,h)      bounded Gauss limitedLinear 0.2;
   // div(phi,k)      bounded Gauss limitedLinear 0.2;
   // div(phi,epsilon) bounded Gauss limitedLinear 0.2;
   // div(phi,omega) bounded Gauss limitedLinear 0.2;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
